feat: completar integracion Feign y documentacion Hito 2
